# Numpy

## 1

In [1]:
import numpy as np
import pandas as pd

In [12]:
a = np.array([[1, 6],
             [2, 8],
             [3, 11],
             [3, 10],
             [1, 7]])
mean_a = a.mean(axis = 0)
print(mean_a)

[2.  8.4]

## 2

In [14]:
a_centered = a - mean_a
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

## 3

In [34]:
a_centered_sp = np.dot(a_centered[:,0], a_centered[:,1])
a_centered_sp / (a.shape[0]-1)

2.0

## 4

In [39]:
np.cov(a.T)[0,1]

2.0

# Pandas

## 1

In [6]:
authors = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name": ["Тургенев", "Чехов", "Островский"]
})

books = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
})
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## 2

In [17]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## 3

In [40]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

## 4

In [55]:
groupby = authors_price.groupby("author_name")
max_ = groupby["price"].max()
min_ = groupby["price"].min()
mean = groupby["price"].mean()

authors_stat = pd.DataFrame({
    "author_name": ["Островский", "Тургенев", "Чехов"],
    "min_price": [min_[0], min_[1], min_[2]],
    "max_price": [max_[0], max_[1], max_[2]],
    "mean_price": [mean_[0], mean[1], mean[2]]
})
authors_stat

  author_name  min_price  max_price  mean_price
0  Островский        290        370  330.000000
1    Тургенев        300        450  366.666667
2       Чехов        450        500  475.000000

## 5

In [68]:
authors_price["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
book_info = pd.pivot_table(authors_price, values = "price", index=["author_name"], columns=["cover"], aggfunc=np.sum, fill_value=0)

cover        мягкая  твердая
author_name
Островский        0      660
Тургенев        650      450
Чехов           950        0